[
{"ad_url": "/rc/clk?jk=8455e58a11f61ff8&fccid=920e697cdf154a3c&vjs=3", "job_title": "Software Engineer", "company_rating": "4", "number_of_ratings": "24", "job_description": ["Goodway Group is #3 on Ad Age's Top Companies to Work For 2021, ", "has been fully remote for 12+ years, has fantastic virtual culture, and we're GROWING!", "\nThis position can be located anywhere in the US, working virtually from a home office.", "\n", "\nOur development philosophy is to work as small, focused, nimble groups, building everything from the front-end to the back-end. We divide up work on a product basis, and you'd be responsible for making sure your features have a clear user interface, perform and scale, and have legible and easy to maintain code. You may not be familiar with all of the specific technologies we use, but you should be excited about the opportunities to pick them up.", "\nWork you will be doing:", "\nDeveloping services in support of analyzing and making decisions on the data generated from the 200 milliseconds, real-time auctions behind nearly every browser page-load across the open internet.", "\nCrafting software services to interact with Google, Facebook, Microsoft, Salesforce, YouTube, Bing, and a continuously expanding array of established and emerging players on the open internet.", "\nContributing to industry-leading, award-winning software in the growing Digital Marketing industry.", "\nThe right person will feel at home at Goodway because:", "\nWe prefer open-source, being scrappy/nimble over proprietary technologies, all-day meetings, and corporate bureaucracy.", "\nYou can ditch your commute since we’re 100% virtual – everyone works at home, but we get together a few times each year. We make being physically together a celebration filled with good times and opportunities for new experiences.", "\nWe encourage personal growth and professional development through technical seminars/cyber-training, mentorships, and leadership opportunities. We have a long history of promoting from within and a career ladder that provides opportunities in both technical and managerial tracks.", "\nWe focus on making your career fit into your life, not your life fitting into your career.", "\nWe have a solid 5-year vision which we’d enjoy sharing with you during the interview process.", "\nThings we’re looking for in our engineers:", "\n2+ Years of experience writing software in a professional setting.", "\nStrong listening and communication skills (written and verbal), including communicating effectively with non-technical customers.", "\nWillingness and demonstrated ability to learn new technologies and skills.", "\nAbility to collaborate well with internal and external partners and thrive in an agile environment with limited oversight.", "\nComfortable and committed to multi-tasking work in a small but rapidly growing environment.", "\nA big plus: an interest in internet advertising, algorithmic ad trading, workflow automation, a/b testing, data warehousing, and solving business problems in collaboration with customers.", "\nThings we work with currently:", "\n", "\nSolid understanding of data warehousing, relational databases, and data modeling/design techniques and tuning (non-relational database experience a plus).", "\nAdvanced SQL skills, including query optimization.", "\nExperience working in \"big data\" platforms and related tools & scripting languages, including:", "\nAmazon Redshift & EMR, Presto, Hive, Python, Spark, Scala, BASH & K-shell scripting, etc.", "\nExperience building data pipelines with open source tools such as Airflow and Argo.", "\nModern web tech including: GraphQL, Node JS, REST APIs HTML-5, CSS, XML, JSON, Javascript and JS Libraries, etc.", "\nStrong design and coding skills in modern object-oriented or functional languages (Javascript, Java, C#, Python, Scala, etc.)", "\nWhile these are the technologies we currently use, we want to find people committed, like we are, to using the right tools for the job and want to be part of the evolution of our technical architecture and systems.", "\nGoodway Group", " is the leading independent programmatic media services company and digital marketing agency on the planet. As a 3rd generation, family-owned business with no investors or debt, Goodway has the technical feel of a startup and the stability of strong funding and investments in tech! The Digital Advertising and Marketing sector is a HUGE growth area with enormous opportunities!", "\nRecent accolades:", "\nFully remote culture for 12+ years", "\n2021 Ad Age Best Places to Work", "\n2020 Finalist Digiday Worklife Awards", "\n2020 AdExchanger Programmatic Power Player", "\n2020 MarTech breakthrough awards", "\nOther Good to Knows!", "\nProfitable and Growing", "\nAgile and Collaborative culture", "\nHuman-first mentality", "\nTraining days once a month, free access to all LinkedIn learning, Trade Desk Training programs, and all of our proprietary training", "\n$1500/yr learning budget", "\nHome office expense allowance", "\nMYTime (Unlimited Flexible PTO)"]},
{"ad_url": "/rc/clk?jk=901a8d923474a311&fccid=78ba8c9950e5297a&vjs=3", "job_title": "Associate Software Engineer", "company_rating": "3.7", "number_of_ratings": "291", "job_description": ["The Genesys Cloud UI team is looking for a talented software engineer for front-end web development. We build a cloud-based contact-center and communications platform that’s growing incredibly fast. The ideal candidate is a results-driven, self-motivated, front-end developer. The candidate must show the capacity to work, collaborate and communicate effectively in a dynamic enterprise software development environment.", "\n", "What you will do while working with us:", "\n", "Work with team members, UX and Product Management teams to design, develop, and test features that meet the business needs of our customers.", "\n", "Jump into various complex code-bases, understand them quickly, and develop features and bug fixes in a fast-paced environment.", "\n", "Help us evolve our platform to deliver features to customers faster and with fewer issues", "\n", "Work with modern front-end web technologies such as Ember, Angular, Typescript, Elm, and Web Components", "\n", "Contribute to our team-maintained continuous deployment pipeline", "\n", "Foster an inclusive working environment where every team member is positioned for success", "\n", "Learn and teach by participating in code reviews, direct collaboration, and open discussions", "\n", "Exhibit thoroughness in evaluating all aspects of a solution including localization, licensing, scalability, memory management, bandwidth, latency, automated testing, security, and compliance.", "\n", "Write and maintain unit, integration, and acceptance tests.", "\n", "Stay current with industry developments and new trends.", "\n", "Understand and comply with HIPAA security and privacy rules.", "\n", "Adhere to Genesys Code of Business Conduct and Ethics.", "\n", "About you:", "\n", "Relevant experience building web applications in JavaScript or similar languages.", "\n", "Bachelor’s degree in Computer Science or relevant, proven industry experience", "\n", "Excellent written and verbal communication skills", "\n", "Excellent analytical and diagnostic skills", "\n", "Resourceful and detail-oriented developer", "\n", "Strong object-oriented analysis and design patterns experience", "\n", "Ability to multi-task, prioritize, and be detail-oriented", "\n", "Legally eligible to work in the U.S.", "\n", "\n", "Some of the benefits of working with us:", "\n", "An open time-off policy and management team that supports its use", "\n", "The flexibility to work from home or remotely as needed", "\n", "Working with a team committed to work-life balance", "\n", "Annual budget for technical conferences and career development", "\n", "Benefits", "\n", "Medical, Dental, and Vision Insurance", "\n", "Telehealth coverage", "\n", "Flexible work schedules and work from home opportunities", "\n", "Development and career growth opportunities", "\n", "Open Time Off", "\n", "401(k) matching program", "\n", "Adoption Assistance", "\n", "Infertility treatments", "\n", "\n", "See more Genesys benefits information at https://mygenesysbenefits.com/", "\n", "Covid-19:", "\n", "Safety for our employees and our communities is a key priority for Genesys. We continue to experience rapid growth during the Covid-19 pandemic and are conducting remote hiring and onboarding processes. All hiring and onboarding processes are being conducted remotely at this time. We utilize Zoom video meetings and phone calls during the interview process. We will be working remotely through at least June 30, 2021, in most locations, and we are re-evaluating the opening date of all the Genesys offices on an ongoing basis.", "\n", "\n", "About Genesys:", "\n", "Every year, Genesys® delivers more than 70 billion remarkable customer experiences for organizations in over 100 countries. Through the power of the cloud and AI, our technology connects every customer moment across marketing, sales and service on any channel, while also improving employee experiences. Genesys pioneered Experience as a Service℠ so organizations of any size can provide true personalization at scale, interact with empathy, and foster customer trust and loyalty. This is enabled by Genesys Cloud™, an all-in-one solution and the world's leading public cloud contact center platform, designed for rapid innovation, scalability and flexibility. Visit www.genesys.com.", "\n", "\n", "Genesys is an equal opportunity employer committed to diversity in the workplace. We evaluate qualified applicants without regard to race, color, age, religion, sex, sexual orientation, gender identity or expression, marital status, domestic partner status, national origin, genetics, disability, military and veteran status, and other protected characteristics."]},
{"ad_url": "/company/Neurobehavioral-Systems,-Inc./jobs/Software-Engineer-8c885696e095e810?fccid=4c9ab182d64dbb93&vjs=3", "job_title": "Software Engineer", "company_rating": null, "number_of_ratings": null, "job_description": ["Position", ": Software Engineer", "We're seeking a developer to be a primary contributor in the development of a new product in medical diagnostic testing. You will be a core member in a small collaborative team, working in a lean startup environment with no BS or pointy haired bosses. You will be involved in all aspects of development over the complete product life cycle. You will have the opportunity to learn and use a diverse range of technologies.", "Sample activities: ", "* Web server programming in Scala", "* AWS server configuration and maintenance", "* Browser client programming in Scala.js", "* Desktop application programming in C++", "* Data analysis programming in Scala", "Requirements", ":", "* Professional and collaborative attitude", "* Motivation to make great software", "* Dedication to quality, and pride in the work you produce", "* The ability to work and finish a project independently", "* Knowledge, understanding, and respect for good software practices and development methodologies", "* Minimum 4 years of programming experience (in any setting, professional or otherwise)", "* Fluency with Scala or C++ strongly preferred", "Things we use: ", "C++, Scala, Python, C++/CX, AWS, Apache, Mysql, Play framework, Visual Studio, IntelliJ, Windows, iOS, Android, OpenAPI, Confluence, Jira, Trello, Mercurial, Git", "Job Type: Full-time", "Pay: $100,000.00 - $140,000.00 per year", "Benefits:", "Health insurance", "Paid time off", "Retirement plan", "Schedule:", "8 hour shift", "Supplemental Pay:", "Bonus pay", "Education:", "Bachelor's (Required)", "Experience:", "Programming: 4 years (Preferred)", "Work Location:", "Fully Remote", "Relocation Assistance Provided:", "No", "This Job Is Ideal for Someone Who Is:", "Dependable -- more reliable than spontaneous", "Detail-oriented -- would rather focus on the details of work than the bigger picture", "Innovative -- prefers working in unconventional ways or on tasks that require creativity", "Company's website:", "www.neurobs.com", "Benefit Conditions:", "Waiting period may apply", "Only full-time employees eligible", "Work Remotely:", "Temporarily due to COVID-19", "COVID-19 Precaution(s):", "Remote interview process", "Virtual meetings"]},
{"ad_url": "/rc/clk?jk=aebf6319f2a0c34a&fccid=0d857eb74842c683&vjs=3", "job_title": "Software Engineer", "company_rating": null, "number_of_ratings": null, "job_description": ["Location: Denver or remote", "\n", "\n", "\nThe Opportunity:", "\n", "\nInfinicept is a fast-growing, Denver-based startup. You will be an integral part of a small team that builds and maintains a platform that revolutionizes payment facilitation. We focus on mission critical applications and integrations that are the engine of our business. Our systems deal with large amounts of structured data and high volumes of transactional data that ensure our customers can board and manage merchants and the customer payments that they process.", "\n", "\nWe are a Microsoft shop, hosted entirely in Azure, using C# and .NET CORE 3 to build our products. You’ll use SQL Server, Kubernetes, Azure DevOps, CosmoDB, and a host of scripting and automation technologies to help us create and maintain our software solutions. We use software libraries like NServiceBus, Entity Framework, Swagger/Swashbuckle, and others.", "\n", "\nWe solve problems collaboratively, working together to find the most creative and innovative solutions to the challenges of our space. We value integrity, self-determination and decisiveness. This is a hands-on, shape-a-business-that-is-shaping-an-industry position. If you’re looking for an amazing opportunity with a growing tech company that’s expanding its team, read on!", "\n", "\nGet your career going your way!", "\n", "\n", "\nWho You Are:", "\n", "\n", "You are someone who loves working with back end systems and complex data. You enjoy the creative challenge of designing the best solution to solve a business problem.", "\n", "You’re never satisfied with what you’ve done and are constantly looking for ways to make a system more testable, efficient, reliable, and speedy.", "\n", "You don’t shy away from bringing new ideas to the table because you understand that innovation never stops.", "\n", "You believe in the power of small teams, and enjoy a collaborative process where requirements, design, development, QA, and deployment are everyone’s responsibility.", "\n", "Lastly, you enjoy brainstorming sessions with your peers, product owners, and clients to identify the best approach to design and build.", "\n", "\n", "\nWhat you’ll do:", "\n", "\nYou will be an integral part of a small team that builds and maintains a platform that will revolutionize payment facilitation. You’ll focus on mission critical applications and integrations that are the engine of our business. Our systems deal with large amounts of structured data, and high volumes of transactional data that ensure our customers can board and manage merchants and the customer payments that they process. This is a hands-on, shape-a-business-that-is-shaping-an-industry position.", "\n", "\n", "\nYou also:", "\n", "\n", "Are comfortable with the flexibility required by an early-stage company.", "\n", "Are willing to learn a complex domain ecosystem – payments is not a simple world!", "\n", "Find excitement in challenging problems, aggressive ship dates, and a fast-growing company.", "\n", "Enjoy the prospect of making big decisions that will change the shape of our software.", "\n", "\n", "\nCore Requirements:", "\n", "\n", "2 – 4 years software engineering experience", "\n", "Experience with C#/.NET, SQL Server, Git, Azure and related technologies", "\n", "Enthusiasm for a fast-paced, modern software development culture", "\n", "Fearless, innovative, self-directed", "\n", "Payments experience a plus!", "\n", "\n", "\nBenefits for You:", "\n", "\nInfinicept believes that all team members play an important role in our company’s success. That is why we strive to provide you with a competitive and comprehensive benefit program. We offer:", "\n", "\n", "Competitive salary (range $90,000/annually – $120,000/annually)", "\n", "Growth stage start-up opportunity", "\n", "Flexible vacation policy", "\n", "Comprehensive health, dental, and vision benefits", "\n", "401(k) with match", "\n", "Flexible work from home policy", "\n", "Dog-friendly office", "\n", "A progressive, passionate work environment", "\n", "An amazing team dedicated to both the company’s mission and your success!", "\n", "\n", "\nInfinicept Core Values:", "\n", "\n", "Do the Right Thing", "\n", "Be Excellent (but perfect is impossible)", "\n", "Have Integrity", "\n", "Act Like an Adult", "\n", "Eat and Drink Well", "\n", "\n", "\nWork Environment:", "\n", "\nWork in a typical office environment with other staff speaking on phones or engaging in limited team conversation. The role will involve long periods of stationary movement and frequent use of computers and other hardware. Physical efforts to carry out job duties may include some standing, bending, lifting, limited stretching, and reaching.", "\n", "\nAs part of our dedication to maintaining an inclusive and diverse workforce, Infinicept provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, sexual orientation, national origin, age, disability, or genetics. In addition to federal law requirements, Infinicept complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.", "\n", "We are interested in every qualified candidate who is eligible to work in the United States. However, we are not able to sponsor visas currently.\n", "**No external recruiters or agents, please."]},
{"ad_url": "/rc/clk?jk=c4ed4fc0967fd72d&fccid=7bca63b1586338d7&vjs=3", "job_title": "Software Engineer", "company_rating": null, "number_of_ratings": null, "job_description": ["Since 1976 ", "TX RX Systems, Inc. ", "has been a premier provider of radio frequency (RF) conditioning and combining solutions – our equipment and services enhance radio signals going into and coming out of radio sites. We are seeking Software Engineer in the Buffalo, NY", " ", "region to join our forward-thinking, collaborative team, and sell our solutions in the OEM and field marketplace. You will play a critical role in driving our continued success. You will learn and grow personally and professionally as you are immersed into our long-standing, highly respected organization. This is an excellent opportunity for those interested in building a career with an industry leader.", "\n**Remote work is permitted**", "\nTo the right candidate, we offer:", "Competitive salary plus bonus", "Health, dental, life, disability and vision insurance; 401k with company match; and paid vacation", "Culture with exceptional work-life balance", "Extensive in-house and on-the-job training", "Independence in a collaborative environment, and tremendous professional growth potential", "Environment free of traditional corporate constraints and red tape", "\nROLE OBJECTIVE: To support software development in new products, systems and processes across the company.", "\nThe Software Engineer will interact with members of the engineering team to design and test new software and firmware required for new product development.", "\nGENERAL FUNCTIONS/SPECIFIC RESPONSIBILITIES:", "\nGeneral Functions", ":", "\nPrimarily provides software design support for new product development, test engineering and sustaining engineering support for manufacturing. The Software Engineer may also provide application assistance to IT, sales, purchasing, quality, etc. The Software Engineer may be responsible for all phases of the software development cycle as assigned. These include requirements generation, system design, detailed design, code implementation, testing, post-release maintenance and support to other functional groups and customers as needed.", "\nSpecific Responsibilities", ":", "\n1. Creation of instrument software including firmware and PC based support tools", "\n2. Responsible for identifying, recommending, and using appropriate tools, languages, and methods", "\n3. Technical support and sustaining engineering for manufacturing operations", "\n4. Creation of product software including embedded firmware and PC-based support tools", "\n5. Create and maintain project software documentation and computer aided software-engineering aspects of project management, including software requirements, test documents, and version control documentation", "\n6. Technical support and sustaining engineering for manufacturing operations", "\n7. Technical assistance to sales, customer service, and customers as required", "\n8. Report generation from Avante ERP software, examples: SQL queries and Excel pivot table reports", "\n9. Modifications and maintenance of Apps Engineering Toolkit software", "\n10. Software and/or firmware design as required by the New Product Development team", "\n11. Other design related tasks as required by the Director of Engineering", "\nREQUIRED SKILLS/KNOWLEDGE/COMPETENCIES (Applicant must meet all to be considered):", " Bachelor’s degree in engineering or science and 5 years minimum experience in software and systems development", " Thorough understanding of the underlying principles of software design and development fundamentals", " Experience in the design of PC based applications including SQL", " One to three years of experience with demonstrated technical knowledge of embedded systems", " Experience with assembly and high-level languages for multiple processor types", " General Programming Skills", " Software design, debugging, testing, and documentation", " Excellent oral, verbal, and interpersonal skills", "\nDESIRED SKILLS/KNOWLEDGE/COMPETENCIES (Applicants may be considered even if they do not possess any or all of these):", " Understanding of the underlying principles of software design and software development project management", " C, C++, C#, assembly languages", " Windows and Linux platform development experience", " Object oriented design and programming including Microsoft Windows .NET Framework", " Embedded application design experience (user interfaces, I/O, and device drivers)", " Tool experience (IDEs, Debuggers, Compilers/Linkers, Revision Control, etc.)", " Experience in design of networking and communications protocols", " Knowledge of software development processes and process tools such as revision control, design and test documents, and tools used to create these documents", " Experience with multiple micro-processors and embedded micro-controllers", " Excellent interpersonal and communications skills"]},
{"ad_url": "/rc/clk?jk=c95a864cf609a341&fccid=0d857eb74842c683&vjs=3", "job_title": "Junior Software Engineer", "company_rating": null, "number_of_ratings": null, "job_description": ["Location: Denver or remote", "\n", "\n", "\nThe Opportunity:", "\n", "\nInfinicept is a fast-growing, Denver-based startup. You will be an integral part of a small team that builds and maintains a platform that revolutionizes payment facilitation. We focus on mission-critical applications and integrations that are the engine of our business. Our systems deal with large amounts of structured data and high volumes of transactional data that ensure our customers can board and manage merchants and the customer payments that they process.", "\n", "\nWe work in an entirely .NET stack with a mixture of Core 3/.NET 5 and React JS as the front-end. You will work with software libraries like NServiceBus, Entity Framework, ElasticSearch and others. Our goal is to build highly scalable, distributed systems (transaction processing, data import/mapping, and API integrations) that form the back end of multi-tenant SaaS products.", "\n", "\nAs a junior software engineer with Infinicept, you will have the opportunity to learn your trade in a collaborative, mentorship-focused environment.", "\n", "\nWe solve problems collaboratively, working together to find the most creative and innovative solutions to the challenges of our space within finance and technology. We value integrity, self-determination, and decisiveness. This is a hands-on position that provides the opportunity to help shape a business that is shaping an entire industry. If you’re looking for an amazing opportunity with a growing tech company that’s expanding its team, read on!", "\n", "\nGet your career going your way!", "\n", "\n", "\nWho You Are:", "\n", "\nYou are excited and enthusiastic about developing their career as a software engineer. You may be a recent bootcamp grad, a CS student, or from an entirely different career background. You don’t shy away from bringing your unique experiences and values to your role as a junior engineer. You are fearless and will dive headfirst into unfamiliar problems.", "\n", "\nYou are motivated, engaged, and eager to learn – always looking for opportunities to contribute to the team and the products we support.", "\n", "\n", "\nYou also:", "\n", "\n", "Don’t shy away from bringing new ideas to the table because you understand that innovation never stops.", "\n", "Believe in the power of small teams and enjoy a collaborative process.", "\n", "Are comfortable with the flexibility required by an early-stage company.", "\n", "Are willing to learn a complex domain ecosystem – payments is not a simple world!", "\n", "Find excitement in challenging problems, aggressive ship dates, and a fast-growing company.", "\n", "Enjoy the prospect of making big decisions that will change the shape of our software.", "\n", "Enjoy the prospect of brainstorming sessions with your peers, product owners, and clients to identify the best approach to design and build.", "\n", "\n", "\nCore Requirements:", "\n", "\n", "Fearless, innovative, self-directed", "\n", "The ability to reason about complex, unfamiliar problems", "\n", "Some familiarity with programming fundamentals", "\n", "A thirst for learning", "\n", "\n", "\nBenefits for You:", "\n", "\nInfinicept believes that all team members play an important role in our company’s success. That is why we strive to provide you with a competitive and comprehensive benefit program. We offer:", "\n", "\n", "Competitive salary (range $60,000/annually – $90,125/annually)", "\n", "Growth stage start-up opportunity", "\n", "Flexible vacation policy", "\n", "Comprehensive health, dental, and vision benefits", "\n", "401(k) with match", "\n", "Flexible work from home policy", "\n", "Dog-friendly office", "\n", "A progressive, passionate work environment", "\n", "An amazing team dedicated to both the company’s mission and your success!", "\n", "\n", "\nInfinicept Core Values:", "\n", "\n", "Do the Right Thing", "\n", "Be Excellent (but perfect is impossible)", "\n", "Have Integrity", "\n", "Act Like an Adult", "\n", "Eat and Drink Well", "\n", "\n", "\nWork Environment:", "\n", "\nWork in a typical office environment with other staff speaking on phones or engaging in limited team conversation. The role will involve long periods of stationary movement and frequent use of computers and other hardware. Physical efforts to carry out job duties may include some standing, bending, lifting, limited stretching, and reaching.", "\n", "\nAs part of our dedication to maintaining an inclusive and diverse workforce, Infinicept provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, sexual orientation, national origin, age, disability, or genetics. In addition to federal law requirements, Infinicept complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.", "\n", "We are interested in every qualified candidate who is eligible to work in the United States. However, we are not able to sponsor visas currently.\n", "**No external recruiters or agents, please."]},
{"ad_url": "/company/Stock,-Garber,-and-Associates/jobs/Full-Stack-Software-Engineer-9d1fedab8369589e?fccid=e20e87832782e922&vjs=3", "job_title": "Full Stack Software Engineer", "company_rating": null, "number_of_ratings": null, "job_description": ["Serving the YMCA community is at the heart of everything we do at SGA. If you have a passion for community enrichment and experienced the positive impact the YMCA has had in communities around the world, you would appreciate working for SGA. We have a unique opportunity to serve hundreds of thousands of people across the United States by providing operations and financial software solutions to not-for-profit organizations.", "As a full-stack engineer at SGA, you will work on a variety of projects and tasks. We are a small company and require that all of our staff wear multiple hats. Our primary objective is to find someone with the technical prowess to be able to handle exciting new challenges and also grind through the boring day-to-day tasks. SQL is at the foundation of everything we do. We don’t really care about your education so long as you can demonstrate that you can produce tangible results, have a positive attitude, and work well with others. At the end of the day, we care more about your attitude than your skill. If you have a good attitude, we can teach you the rest. As far as skill sets, we are looking for someone with strong SQL knowledge, and experience with .Net. If you have experience with VB.Net, that would be super. However, C# or other similar programming experience would be considered.", "Job Type: Full-time", "Pay: $50,000.00 - $84,000.00 per year", "Benefits:", "Health insurance", "Paid time off", "Retirement plan", "Vision insurance", "Schedule:", "8 hour shift", "Supplemental Pay:", "Bonus pay", "COVID-19 considerations:", "Everything we do is remote—so no need to worry about human interaction.", "Education:", "High school or equivalent (Preferred)", "Experience:", "SQL: 2 years (Required)", ".NET: 2 years (Required)", "Language:", "English (Required)", "Work Location:", "Fully Remote", "This Job Is Ideal for Someone Who Is:", "People-oriented -- enjoys interacting with people and working on group projects", "Adaptable/flexible -- enjoys doing work that requires frequent shifts in direction", "Achievement-oriented -- enjoys taking on challenges, even if they might fail", "Innovative -- prefers working in unconventional ways or on tasks that require creativity", "This Job Is:", "A good fit for applicants with gaps in their resume, or who have been out of the workforce for the past 6 months or more", "Open to applicants who do not have a college diploma", "A job for which people with disabilities are encouraged to apply", "Company's website:", "sgasoftware.com", "Benefit Conditions:", "Only full-time employees eligible", "COVID-19 Precaution(s):", "Remote interview process", "Virtual meetings"]},
{"ad_url": "/company/Jacob-Darr-Associates/jobs/Software-Engineer-43749da0f3bd7f4e?fccid=b2ca2b88bb399ef4&vjs=3", "job_title": "Software Engineer", "company_rating": null, "number_of_ratings": null, "job_description": ["Position Description", "Help Create a Software Platform and Get in on the Ground Floor of a Cutting-Edge Technology Company", "This unique role is an exciting opportunity for a talented Software Engineer to showcase their skills to make a direct impact on our platform and solutions. In fact, you’ll be a key founding member of the group as you leverage your experience to build web-scale applications using Agile methodologies.", "If you are ready to join a company that values its employees and celebrates every win, we invite you to consider the role of Software Engineer. Consider a few of the many advantages of stepping into the role:", "This is an ", "exciting time", " to join us as we are equipped for tremendous growth and scalability. We are at the starting line, and you’ll have the opportunity to apply yourself to help build something big and feel a sense of pride in your work.", "Pivotal to your success will be your ability to establish strong, trust-based relationships with your team of Engineers. This is an environment where we strive for the success of the team, not just the individual. Your ", "success will be visible", " across the enterprise and beyond as you serve as an in-house ", "software engineering expert.", "You’ll enjoy the ", "best of both worlds", ": the energetic environment of a startup combined with the solid financial backing and resources of our investor. This is a role where you will gain broad architectural, design, and software engineering exposure in a short amount of time.", "In addition to a ", "competitive salary and bonus incentive program", ", we offer a ", "comprehensive benefits package", ". Furthermore, you’ll enjoy the ", "collaborative, team-focused culture", " that we have cultivated. We take pride in being a privately backed technology startup with a well-developed set of existing customers in a very large, relatively untapped market. With a focus on cloud-native solutions leveraging the very latest core components for our stack, we offer the very best opportunity for not only our clients but for our dynamic team of Software Engineers and Architects.", "Role Overview", "You will work with the platform and embrace the latest in cloud-optimized technologies in order to deliver massive scale, extreme availability, and full automation as our organization rapidly expands its offerings to clients and third-party service providers leveraging our solutions.", "We’re seeking a strong Software Engineer who can take ownership of the development process and outcomes while also leading by example and sharing best practices with the team. We run very lean, and you’ll join a team of 15 employees total (including 6 other Software Engineers and 4 other Engineering professionals).", "Role Specifics", "More specifically, your key job tasks will be to:", "Build a scalable, highly available application solutions that leverage public cloud services by designing and developing customer and vendor-facing applications to be cloud-optimized.", "Work alongside business, development, and infrastructure teams and provide deep software development knowledge with respect to full-stack development, design patterns, and object-oriented programming.", "Understand and implement industry best practices and will work as both an infrastructure and application development specialist.", "Utilize Agile software development and DevOps, implementing DevOps practices such as infrastructure as code, continuous integration, and automated deployment.", "Participate in the development process, able to commit to, accept, and deliver on deadlines, communicate daily progress to senior staff in daily stand-ups.", "Be highly task and production-oriented, while participating in weekly product development meetings with architects and business leaders.", "Communicate with users and stakeholders in the development, clarification, and testing of deliverables.", "The Ideal Candidate", "The ideal candidate will have a holistic, “big picture” understanding of the relationship between the front-end and back-end and how to solve real-world problems. Additionally, to find success in this role you will have:", "A bachelor’s degree, associate’s degree, technical degree/training OR equivalent combination of education and experience.", "3+ years of large-scale software development or application engineering with strong coding experience in a variety of computer programming languages. Experience should include familiarity with a combination of several of the following: C#, Java, HTML, CSS, JavaScript, C/C++, C#, Objective-C, Node.js, .NET, Go, Python, PHP, Ruby, etc.", "Strong experience with Agile development methodologies.", "Full-Stack design and development experience (must have front-end, service layer, and back-end data storage experience).", "Good experience with Continuous Integration and Continuous Delivery (CI/CD).", "Mobile experience in either Android or iOS.", "Experience designing and programming applications in an internet-based or cloud environment, front-end framework such as Angular or React, using public cloud services, container, and serverless technologies.", "Experience building highly available systems that utilize load balancing, horizontal scalability, and high availability.", "Experience with continuous integration tools (e.g. Jenkins).", "Familiarity with DevOps.", "Strong written and verbal communication skills.", "The ability, capacity, and desire to serve in a team lead capacity.", "Intellectual curiosity and a passion for continuous learning and improvement.", "Databases: We use MSFT SQL (on-prem) and use Azure SQL and Redis in the cloud. SQL knowledge is highly desirable!", "Success Factors", "To excel in In this role, you will be eager to take ownership of the entire software development lifecycle and put your fingerprints on the platform. Despite the smaller size of our company, we have a very complex ecosystem in place. You’ll need to leverage your strong technical aptitude to come up to speed quickly. We understand there will be a learning curve as you step into the role, but the right candidate will view this as an exciting opportunity versus a roadblock. We’re looking for a professional who has a deep aptitude for large-scale distributed systems.", "Job Type: Full-time", "Pay: $75,722.00 - $159,890.00 per year", "Benefits:", "401(k)", "Dental insurance", "Health insurance", "Paid time off", "Vision insurance", "Schedule:", "8 hour shift", "Education:", "Bachelor's (Preferred)", "Experience:", "Agile Methodologies: 2 years (Preferred)", "Work Location:", "Fully Remote"]},
{"ad_url": "/rc/clk?jk=b8b9beac6595a892&fccid=15c26b2f7c7309c1&vjs=3", "job_title": "C# Software Engineer", "company_rating": "2.7", "number_of_ratings": "157", "job_description": ["We are looking for a C# .NET software engineer to join our ERP development team. We have office locations in Lititz PA and Tampa Fl, and are offering 100% remote work for candidates who reside in one of the following states: (DE, FL, GA, MD, NC, PA, SC, TN or VA)*.", "\n", "\nThe Clark ERP engineering team is responsible for building from scratch software which acts as the heart of the organization, controlling procurement, warehouse and inventory management, logistics, sales order processing, vendor and customer management, and company financials. We operate across multiple business units, integrate with numerous other systems, and support new business initiatives and data collection for one of the fastest growing companies in PA.", "\n", "\nTechnology-wise, the ERP software engineering team uses a Microsoft .NET development stack with C# as our language of choice. The main system we support is a WPF desktop application; however we also work on numerous web services, queued services, front-end web interfaces, and mobile apps.", "\n", "\n", "\nRequirements:", "\n", "\n", "Experience in C# and SQL Server.", "\n", "Ability to keep track of complicated requirements and business rules.", "\n", "Ability to take start-to-finish ownership of the full development life cycle.", "\n", "Self-driven with a strong desire to contribute, learn, and improve.", "\n", "\n", "\nWhat it’s like to work here:", "\n", "\nWe look for employees with a strong desire to grow, ask questions, and challenge themselves. We practice agile methodologies, and employees have an open channel of communication with each other and their managers. Design is done in a collaborative manner, and we look for people to offer their opinions. Clark offers a competitive benefits package, goes above and beyond with a 401K with company match, performance bonuses, an in-office gym and showers or gym membership reimbursement, and remote work. Take a look at our careers page for more details: https://www.webstaurantstore.com/careers/", "\n", "H-1B visa sponsorship is not available (W2 only)", "\n", "Must be authorized to work in the US", "\n", "Remote employees will be required to have access to High Speed internet, a distraction free workspace, and a physical address (no PO boxes) in the allowed states."]},
{"ad_url": "/rc/clk?jk=e64a2d33cfa516e3&fccid=b09992f0f82e9249&vjs=3", "job_title": "Software Engineer", "company_rating": "3.5", "number_of_ratings": "231", "job_description": ["RPS North America", " provides engineering, environmental, and scientific advice across the US and Canada. We offer a comprehensive range of consulting services and technology solutions to support our clients in all sectors of the economy. We serve as the North American platform of ", "RPS Group", ", one of the world's preeminent consultancies.", "\nRPS", " ", "Ocean Science Division is a dedicated team of talented scientific and technical individuals working together to provide our clients with cutting edge solutions to meet their evolving needs. As a recognized industry leader, our clients seek our guidance, and we provide a service that ensures their success. We do this in an exciting and collaborative environment that combines our scientific knowledge, technical expertise, and leading-edge technology to provide unique software solutions. At RPS we solve problems that matter. Come be a part of our journey to create shared value to a growing, urbanizing and resource-scarce world.", "\nRPS Group is looking for a Software Engineer to help us implement our next generation of web-based Ocean Science products. This role requires a passion for using technology to solve complex business problems. You will be a key member of a growing software engineering team and contribute to the design, development, and maintenance of one of our core products. In this position, you will have responsibility for innovative code designs and solutions that provide both modularization and scalability of development that meets feature and schedule goals. You will work within our software engineering team and interact with our project managers and product owners to develop world-class products.", "\n", "Key Responsibilities:", "\nDevelop and grow the RPS Ocean Science core web products", "\nProvide expertise with web-based technologies including JavaScript (React)", "\nDevelop, test, and deploy scalable, secure, high performance applications", "\nWrite unit and integration tests", "\nWork with limited supervision in a fast-paced environment", "\nCollaborate with Product Managers to deliver products for our clients", "\nTechnical mentoring of software engineers at all levels", "\nReview designs and software written by team members", "\n", "Requirements:", "\n3+ years of professional experience developing JavaScript based dynamic web applications", "\nExperience with front end frameworks including React", "\nProficiency with at least 2 programming languages (Java, JavaScript, Python, C, C++, C#)", "\nKnowledge of RESTful APIs (use and implementation)", "\nUnderstanding of CI/CD", "\nComfortable working in a Unix/Linux environment", "\nSelf-motivated problem solver", "\nDemonstrated ability to learn/adapt to new technologies", "\nBachelors Degree in Computer Science or related field", "\n", "RPS is an industry leader and we pride ourselves on our ability to attract and retain exceptional talent by treating our employees well. In addition to competitive compensation packages, we offer:", "Medical, dental, disability, and life insurance coverage for employees and families, with no waiting period and generous contributions to monthly premiums.", "401(k) Plan, with a dollar-for-dollar Company match of employee contributions, up to 5% of eligible compensation", "Share Purchase Plan, which enables employees to purchase shares via payroll deductions at 85% of market value, with the Company matching employees’ shares 1:1", "Flexible Spending Accounts for health care and dependent care costs.", "Performance-based bonus program.\n", "Generous vacation and sick leave policies in addition to company-wide paid holidays.", "\nRPS North America provides equal employment opportunity to all employees and job applicants without regard to race, color, religion, sex, national origin, age, disability, or other protected characteristics. RPS complies with all applicable federal, state, and local laws and requirements governing nondiscrimination in every location in which we operate."]},
{"ad_url": "/pagead/clk?mo=r&ad=-6NYlbfkN0BKgzQyzTF1Q9mOsR1amaS-juVGLjHt5Cdom-gEF9y-xV8YZYg85SiYKbRKw0cdSX2KccoNtxR-HOLShdi2YNe_RMhH1YX12CIuFS745GFyiB_rZ2K_K00ijHS5gNg5EM-nbqBzXYvOAuyJurhHOMJeXYEKa-In8J5HtH0e8G7JtXbftMcLIwyNYfcuc5NH526ciAXyhhw3jScfo4T_T7EAVzD1UdHSamVr2L4fls3cNX7u_zPfECn6zBqWuW4N_UDurAQNNh89ACthNsbwqdp7KEkplqjL8kDkMwZRHOZUGCzTiTtgQ7yYtpnLxBb0KjNvOZsQuV5_eoOMXSFr20h_KOjxiTPOO9XVKjgilPD1qiVfPawmq0p7TT30mXjoYYaM1ug-om45YIbspn1O496VyrMNMUFMi13P7XtDGUT9S0p6ZAOjFPYzc7o_O2mKvjaTtmhuciyZ2NR9qzX9QWFe&p=0&fvj=1&vjs=3", "job_title": "Engineer", "company_rating": null, "number_of_ratings": null, "job_description": ["AWS / GCP / AZURE Kubernetes Engineer ", "About us", "CitizenDeveloper is at the cutting edge of no-code development and needs a rockstar cloud orchestration engineer interested in both salary and generous equity based compensation.", "We are looking for passionate software engineers to work at the intersection of Containers, Cloud and Automation - Kubernetes, AWS/GCP/Azure and Containerized Microservices on our Cloud Native Platform as a Service.", "We embrace a culture of experimentation and constantly strive for improvement and learning. You'll work in a collaborative, trusting, thought-provoking environment-one that encourages diversity of thought and creative solutions that are in the best interests of our customers both internally and globally. You'll work alongside an experienced team that's been building in Platform as a Service since 2001, experts in React, Backend Service design and implementation, and report to our Chief Technology Officer, a 20 year veteran.", "Experience In The Following Is Required: ", "Programming experience in : Node.js", "Container Platforms and Technologies - Kubernetes, Docker, including HPA's/Auto Scaling and related ecosystem tooling", "MIcroservice Orchestration Methodologies - Message Queueing theory, Sidecar and Multi-Container Pod Configurations", "Provider Agnostic Logging and Monitoring - ELK Stack, Prometheus", "Public Cloud - Provisioning, IAM, Databases, Networking, Monitoring on AWS, GCP.", "Networking Concepts - Cloud Native and Public cloud concepts, particularly with Kubernetes and AWS and GCP ecosystems", "Good understanding of systems design, modern software development best practices and distributed systems programming and architecture", "Solid understanding of Software Development lifecycle (SDLC), agile practices, testing approaches and related toolchain and ecosystem.", "Experience In The Following Is Beneficial: ", "Programming experience in : Python, Node.js Promises and aSync routines.", "Microservice Orchestration Methodologies - RabbitMQ, Consul", "Public Cloud - Provisioning, IAM, Networking, Monitoring on Azure", "Networking Concepts - Cloud Native and Public cloud concepts, particularly with Kubernetes and Azure ecosystems", "Provisioning Public Cloud Database Services - MySQL, Google Cloud Spanner, Microsoft SQL Server", "HA and Resilient Systems Architecture", "Container Automation with Helm", "Related keywords: engineer, mechanical engineer", "Job Type: Full-time", "Pay: From $94,000.00 per year", "Benefits:", "Dental insurance", "Flexible schedule", "Health insurance", "Health savings account", "Life insurance", "Paid time off", "Retirement plan", "Vision insurance", "Schedule:", "8 hour shift", "Monday to Friday", "On call", "Supplemental Pay:", "Bonus pay", "Application Question(s):", "How many years programming experience in Node.js?", "How many years experience in microservice Orchestration Methodologies - Message Queueing theory, Sidecar and Multi-Container Pod Configurations?", "How many years experience with provider agnostic Logging and Monitoring - ELK Stack, Prometheus etc?", "How many years experience with public cloud provisioning - IAM, Databases, Networking, Monitoring on AWS, GCP.", "Education:", "Bachelor's (Preferred)", "Experience:", "Kubernetes and AWS and GCP ecosystems: 3 years (Required)", "Container autoscaling - Kubernetes, Docker, including HPA's: 2 years (Required)", "Work Location:", "Fully Remote", "Company's website:", "https://www.citizendeveloper.com/", "Benefit Conditions:", "Waiting period may apply", "COVID-19 Precaution(s):", "Remote interview process", "Virtual meetings"]},
{"ad_url": "/rc/clk?jk=6ce99f9246bb1188&fccid=51dc2e5aecda9e29&vjs=3", "job_title": "Software Engineer (Python)", "company_rating": "4.1", "number_of_ratings": "21", "job_description": ["Job Description:\n", "The Opportunity:", "\n", "\n", "Pluralsight's Flow team is looking for an experienced software engineer to help build the next iteration of its industry leading engineering analytics platform. We are looking for someone who can hit the ground running and help us deliver on key objectives in the first half of 2021.", "\n", "\n", "Who you are:\n", "You have excellent communication skills\n", "You have a passion for learning\n", "You have demonstrated that you are a strong collaborator and a trusted teammate\n", "Experience you'll need:\n", "Professional software development experience\n", "Proficiency with Python programming language\n", "Experience in the design and development of sophisticated, modern web applications and services\n", "Experience with relational databases, primarily Postgres\n", "Experience with Python frameworks, primarily Django", "\n", "\n", "Bonus Points:\n", "Kafka\n", "ReactJS\n", "Django Rest Framework\n", "Microservices\n", "#LI-AC1"]},
{"ad_url": "/rc/clk?jk=5f8f4affb9caad41&fccid=4b5d257051285786&vjs=3", "job_title": "Associate Software Engineer", "company_rating": "3.4", "number_of_ratings": "15", "job_description": ["Job Summary:", "\nAs a DSS engineer, you’d work on the next big thing. That could be scaling an API to serve millions of requests per second, managing state across multiple regions, or building new mechanisms to secure our video content. Join our DSS engineering community.", "\n", "\nResponsibilities", "\nYou'd be joining a group with a startup feel that collaborates on breakthrough streaming media technology.", "\n", "\nEvery single day as a DSS engineer is different! On any one day you might:", "\nMake an immediate impact by shipping a major feature as part of a small team", "\nWork on projects that have direct, daily impacts on consumers.", "\nBuild tooling and dashboards to monitor the health of your applications", "\nOptimize a build and release pipeline to get software to production efficiently and safely", "\nMeet with an industry-leading partner about a new project", "\nJoin the crew at happy hour or screening of a new movie", "\nWork from home (you’d have the flexibility to do this on occasion)!", "\n", "\nBasic Qualifications", "\nPlease apply if you have:", "\n1-3 years experience developing software applications", "\n1+ years experience developing Scala or Java applications;", "\nThe ability to effectively collaborate - using strengths of many;", "\nNatural curiosity - you enjoy digging deeper to see the big picture;", "\nKnow-how in shipping products.", "\nAdditional Qualifications", "\nIt would also be nice if you are:", "\nBA/BS in Computer Science or a related software field", "\nAdept at leveraging AWS cloud infrastructure", "\nExperienced with real time messaging platforms such as Kafka or AWS Kinesis", "\nWorking knowledge with Redis and/or DynamoDB"]},
{"ad_url": "/rc/clk?jk=adf4961418f2f6d0&fccid=d3d3520998346837&vjs=3", "job_title": "Associate Software Engineer - Telecommute in Washington, D.C", "company_rating": "3.7", "number_of_ratings": "17180", "job_description": ["Combine two of the fastest-growing fields on the planet with a culture of performance, collaboration and opportunity and this is what you get. Leading edge technology in an industry that's improving the lives of millions. Here, innovation isn't about another gadget, it's about making health care data available wherever and whenever people need it, safely and reliably. There's no room for error. Join us and start doing ", "your life's best work.(sm)\n", "If you are located within Washington DC area, you will have the flexibility to telecommute* as you take on some tough challenges.\n", "Primary Responsibilities:\n", "Application Design, Development, Support and Maintenance\n", "Programming Web-based applications in ASP.NET , C# and Microsoft SQL Server; use of HTML, Visual Basic, and JavaScript\n", "Reviewing proposals for major projects and application programming requests and determining feasibility of such projects\n", "Developing detailed plans for new applications, enhancements, changes, upgrades, new reports, and other functional changes to NEA’s software. Plans must address requirements identification and analysis, system design, performance measurements, application testing and release management, training, planning, and oversight\n", "Primary application developer for software applications using Structured Query Language (SQL)\n", "Developing and testing software programs in a production environment that requires working knowledge of the syntax, capabilities, and limitations of the programming language and operating systems for a Microsoft environment\n", "Working closely with system managers in all phases of this work. Provides internal application technical support and is the technical lead on a daily basis for application problem resolution\n", "Participating on the tiger teams designing, documenting, developing, testing, and implementing software programs\n", "Providing quality customer service through the development, production, and integration of software applications that enable customers to successfully meet their business goals. Upon supervisor’s acceptance of an overall approach, determines a design strategy that attempts to anticipate directions of change in workload and Federal requirements to accommodate changes efficiently\n", "You’ll be rewarded and recognized for your performance in an environment that will challenge you and give you clear direction on what it takes to succeed in your role as well as provide development for other roles you may be interested in.\n", "Combine two of the fastest-growing fields on the planet with a culture of performance, collaboration and opportunity and this is what you get. Leading edge technology in an industry that's improving the lives of millions. Here, innovation isn't about another gadget, it's about making health care data available wherever and whenever people need it, safely and reliably. There's no room for error. Join us and start doing ", "your life's best work.(sm)\n", "If you are located within Washington DC area, you will have the flexibility to telecommute* as you take on some tough challenges.\n", "Primary Responsibilities:\n", "Application Design, Development, Support and Maintenance\n", "Programming Web-based applications in ASP.NET, C# and Microsoft SQL Server; use of HTML, Visual Basic, and JavaScript\n", "Reviewing proposals for major projects and application programming requests and determining feasibility of such projects\n", "Developing detailed plans for new applications, enhancements, changes, upgrades, new reports, and other functional changes to NEA’s software. Plans must address requirements identification and analysis, system design, performance measurements, application testing and release management, training, planning, and oversight\n", "Primary application developer for software applications using Structured Query Language (SQL)\n", "Developing and testing software programs in a production environment that requires working knowledge of the syntax, capabilities, and limitations of the programming language and operating systems for a Microsoft environment\n", "Working closely with system managers in all phases of this work. Provides internal application technical support and is the technical lead on a daily basis for application problem resolution\n", "Participating on the tiger teams designing, documenting, developing, testing, and implementing software programs\n", "Providing quality customer service through the development, production, and integration of software applications that enable customers to successfully meet their business goals. Upon supervisor’s acceptance of an overall approach, determines a design strategy that attempts to anticipate directions of change in workload and Federal requirements to accommodate changes efficiently\n", "You’ll be rewarded and recognized for your performance in an environment that will challenge you and give you clear direction on what it takes to succeed in your role as well as provide development for other roles you may be interested in."]},
{"ad_url": "/pagead/clk?mo=r&ad=-6NYlbfkN0BH1qder4dIVBxRvRi6eMxZanAuHRf51dn9ep7wXrT9Fs_an-lvTNgjkSkR8XhHwnq5RXtlcOxGAkIk7061zyiHCALBTKmNOOX0lUfn6z0fp2FpTdFVcQHvZOvq_yDKo903CX7O6k8Tq56kgeqh0BoyngS0vxuUJKyCKrLpgdlznZX5Gtui-Qq4SnjKbc6VLRp0c5F_Pc3HAVSW-bhof0Pd2U1TWYcPoYdEko6XnmgmD1dFy_jWz_z82aRJ_MueX-u1AY4floxcoW2B65whJC86znq9bHEC0RjI_MlkLuGGcofcBliZ8XrYmSsZWYVY3kMiH5wXF6Mv_5R4EgU7ZjX9v4xvBKvyWdDvQszV8_RK5vuSeIOO3dSUNhgLHqBnQJY53xUGLGTHXjUWzV8ZTvFWF7uX7bZupookJNdEjxUM5wEaVYVcjiaIW-FYz12gGRPYFHIB8LhKwLFAq5S3d9at&p=1&fvj=1&vjs=3", "job_title": "RubyonRails Software Engineer", "company_rating": null, "number_of_ratings": null, "job_description": ["What we're looking for: ", "Experience working with complexity. Good code design in the right places is one of the best levers you have as an engineer. But bad design in the wrong places… ouch.", "Ability to deal with the chaos and ambiguity of a startup. Things change, surprises happen. There will be uncertainties in and out of our control. Our job is to ship product and keep the money flowing.", "Attention to detail. You can’t build a great product without being good about the details, whether it's behind the scenes or in the user’s face. We value UX and will go the extra mile to make our product easy, which usually makes implementation harder.", "You're excited to participate in code reviews for learning and ensuring code quality. You should be able to provide constructive feedback to your teammates — and receive it well.", "Senior Engineers who love to provide mentorship and help their teammates grow. Junior Engineers who can learn quickly", ".", "*Some example projects:", "We're a full stack startup. Because of our need to control the user experience and keep our unit costs low, we're very vertically integrated. Some examples of projects you could be working on include...", "Fun banking software. We’ve built our own money management tools to handle $70M investments from 85k transactions. Securities regulations add extra fun.", "Our own version of Mattermark. We'll have thousands of companies fundraising on our platform and we'll need algorithms to identify and curate the best ones.", "Tools for founders, e.g. built-in analytics. Our business grows whenever we make fundraising easier for founders. Why make them integrate Google Analytics when we can provide those insights by default?", "Technical requirements:", "Expert in a web development toolset. We’re a Rails shop, but deep expertise in a web development framework speaks louder than rough familiarity with our preferred toolset.", "Expert in Javascript/CSS and experience with a framework like React. We’re in the process of migrating our UI to React.", "Experience with a relational SQL database. We use Postgres.", "Understanding of accessibility, SEO, responsive design, and website performance.", "Brownie points:", "Experience with payments, security, or \"compliance\"-type problems.", "Scaled systems with 100k/1m/10m/100m/1b transactions.", "You enjoy customer support and working with investors and founders.", "Benefits:", "Market-rate salaries and stock options.", "Unlimited vacation days (mandatory 3 weeks off).", "Medical, dental, & vision insurance.", "401(k) with company match.", "All-expense paid company vacation. We’ve taken three train trips across the country.", "Equipment of your choice.", "Lots of free food and drinks.", "Reimbursement for classes and conferences.", "Invites to S'more Club : )", "*", "Job Type: Full-time", "Pay: $140,000.00 - $225,000.00 per year", "Schedule:", "8 hour shift", "Application Question(s):", "Please Provide Your LinkedIn Profile", "Please Provide Your Email Address", "Education:", "Bachelor's (Preferred)", "Experience:", "RubyonRails: 3 years (Required)", "Javascript/CSS: 3 years (Required)", "React: 3 years (Preferred)", "Work Location:", "Multiple locations", "Visa Sponsorship Potentially Available:", "No: Not providing sponsorship for this job", "Benefit Conditions:", "Only full-time employees eligible", "Work Remotely:", "Yes", "COVID-19 Precaution(s):", "Remote interview process"]}
]